name: "indus"
layers {
  name: "data"
  type: IMAGE_DATA
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  image_data_param {
    source: "Train.txt"
    is_color: false
    batch_size: 64
    new_height: 64
    new_width: 64
  }
}
layers {
  name: "data"
  type: IMAGE_DATA
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  image_data_param {
    source: "Test.txt"
    is_color: false
    batch_size: 26
    new_height: 64
    new_width: 64
  }
}
layers {
  name: "conv1"
  type: CONVOLUTION
  bottom: "data"
  top: "conv1"
  blobs_lr: 1
  blobs_lr: 2
  convolution_param {
    num_output: 20
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layers {
  name: "conv2"
  type: CONVOLUTION
  bottom: "conv1"
  top: "conv2"
  blobs_lr: 1
  blobs_lr: 2
  convolution_param {
    num_output: 50
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layers{
			name: "dropout"
			type: DROPOUT
			bottom: "conv2"
			top: "dropout"
}
layers {
  name: "ip1"
  type: INNER_PRODUCT
  bottom: "dropout"
  top: "ip1"
  blobs_lr: 1
  blobs_lr: 2
  inner_product_param {
    num_output: 500
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layers {
  name: "relu1"
  type: RELU
  bottom: "ip1"
  top: "ip1"
}
layers {
  name: "ip2"
  type: INNER_PRODUCT
  bottom: "ip1"
  top: "ip2"
  blobs_lr: 1
  blobs_lr: 2
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layers {
  name: "accuracy"
  type: ACCURACY
  bottom: "ip2"
  bottom: "label"
  top: "accuracy"
  include: { phase: TEST }
}
layers {
  name: "loss"
  type: SOFTMAX_LOSS
  bottom: "ip2"
  bottom: "label"
  top: "loss"
}
